app/Models/Met/Station.php

    public function getLatestRecordAttribute()
    {
        return $this->data()
            ->select('fecha_hora', 'station_id')
            ->orderByDesc('fecha_hora')
            ->first()?->fecha_hora;
---
select `fecha_hora`, `station_id` from `met_data` where `met_data`.`station_id` = 18 and `met_data`.`station_id` is not null order by `fecha_hora` desc limit 1